<html>
<head><title>The Third Age - Der Brief - Part2</title></head>

<body
background="../pic/back.jpg"
text="#007744"
link="#701000"
vlink="#406000"
alink="#003300"
>

<h1>Was ist ein MUD?</h1>

<font color="#000000">
Ein MUD er&ouml;ffnet eine neue Welt der Kommunikation und Erfahrung. Ich
will versuchen, hier kurz klarzumachen, wie das aussieht ...
</font>
<p>
<font color="#000000">
Ich sitze vor meinem Computer. Ich tippe ein: 
"telnet tta.artis.uni-oldenburg.de 3333". 
Schon baut sich eine Verbindung zu dem MUD-Rechner auf und ich
bekomme den Willkommens-Bildschirm von tta. Der Rechner fragt mich
nach meinem MUD-Login (gleichzeitig der Name meines Charakters, meiner
Rolle im Spiel) und dem Pa&szlig;wort (damit kein anderer meinen Charakter
mi&szlig;brauchen kann). Sobald ich eingeloggt bin, rollt in meinem
Textfenster die Beschreibung des "Raumes" hoch, in dem mein Charakter
sich befindet. Ich stehe auf dem Marktplatz in einem Dorf. Ein Brunnen
pl&auml;tschert munter vor sich hin und eine handvoll Leute stehen mit mir
hier herum und unterhalten sich. Ein Elf in langer, gr&uuml;ner Robe
erkundigt sich nach dem Weg nach Minas Tirith, ein Hobbit verhandelt
mit einem anderen &uuml;ber ein Schwert. Ich sehe die Eing&auml;nge einer
B&auml;ckerei, eines Ausr&uuml;stungsladens und einer Absteige. Weiter
entfernt kann ich ausmachen, wie die Stra&szlig;en, die auf den Marktplatz
m&uuml;nden, &uuml;ber die grasbewachsenen H&uuml;gel fortf&uuml;hren. 
</font>
<p>
<font color="#000000">
Nat&uuml;rlich alles auf Englisch, der Einheits-Sprache vieler MUDs. Und
w&auml;hrend ich die Beschreibung lese, rollt der Text st&auml;ndig weiter
nach oben, um dem Gespr&auml;ch der Hobbits Platz zu machen, das sich
offenbar hinzieht und in Gepl&auml;nkel verliert. Da, jetzt hat der eine
mich erkannt und gr&uuml;&szlig;t mich. H&ouml;flich gr&uuml;&szlig;e ich zur&uuml;ck und
verbeuge mich, mache mich dann aber auf: Ich will heute noch diesen
Becher finden, den ich dem alten Mann geben mu&szlig;, der mir daf&uuml;r einen
Tip versprochen hat... 
</font>
<p>
<font color="#000000">
Ein MUD ("Multi-User-Dungeon") ist eine virtuelle Welt, die nur &uuml;ber
den Austausch geschriebener Worte existiert. Ein Programm steuert das
Ganze, nimmt meine Eingaben entgegen und gibt mir Beschreibungen aus,
die einmal die "G&ouml;tter" in den Computer eingetippt haben. Das
Programm beachtet die Regeln, die in dieser Welt herrschen. Das sind
zun&auml;chst die physikalischen Gesetze, die ja erst programmiert werden
mu&szlig;ten. Das Programm nimmt mir aber auch das Bl&auml;ttern im Regelwerk
ab und das W&uuml;rfeln, wo es die Regeln vorsehen. 
</font>
<p>
<font color="#000000">
In einem g&auml;ngigen MUD tummeln sich bis zu drei&szlig;ig oder vierzig
Spieler gleichzeitig. Tta, da z. Zt. noch im Aufbau, wird bisher nur
von etwa einem Dutzend Leuten heimgesucht, die nicht spielen, sondern
testen und programmieren.
</font>
<p>

<hr>
<address>&#169; <a href="mailto:Markus.Tippmann@informatik.uni-oldenburg.de">manwe</a>, Nov 05, 1996</address>
</body>
</html>
